In [1]:
import pandas as pd
df = pd.read_csv("Exectuion_join.csv", sep=';')
df.columns

Index(['Year_month', 'State', 'State_clearance', 'Homicide_count',
       'Homicide_Clearence', 'month', 'year'],
      dtype='object')

In [2]:
df = df.drop(columns=['Year_month', 'State_clearance', 'Homicide_Clearence','month'])
df.head()

     State  Homicide_count  year
0  Alabama             242  1990
1  Alabama             258  1991
2  Alabama             244  1992
3  Alabama             269  1993
4  Alabama             275  1994

In [3]:
df.to_csv("Exectuion_join.csv", sep=';', index=False)

##### Vymazani nepotrebnych sloupcu

In [9]:
df2 = pd.read_csv("homicide_yearly_sum.csv")
df2.columns

Index(['year', 'State', 'Homicide_count', 'Homicide_Clearence'], dtype='object')

In [10]:
df2 = df2.drop(columns=['Homicide_Clearence'])
df2.head()

   year       State  Homicide_count
0  1985     Alabama             389
1  1985      Alaska              50
2  1985     Arizona             251
3  1985    Arkansas             184
4  1985  California            2770

In [12]:
df2.to_csv("homicide_yearly_sum.csv", sep=';', index=False)

#### Vyfiltrovani tabulky kde neni Alabama

In [13]:
df2 = df2[df2['State'] != 'Alabama']
df2.head()

   year       State  Homicide_count
1  1985      Alaska              50
2  1985     Arizona             251
3  1985    Arkansas             184
4  1985  California            2770
5  1985    Colorado             189

In [14]:
df2.to_csv("Homicide_WoA.csv", sep=';', index=False)

#### Spojeni dvou finalnich tabulek

In [15]:
df1 = pd.read_csv("Exectuion_join.csv", sep=';')
df2 = pd.read_csv("Homicide_WoA.csv", sep=';')

# spoj pod sebe
df_spojene = pd.concat([df1, df2], ignore_index=True)
df_spojene.head(20)

      State  Homicide_count  year
0   Alabama             242  1990
1   Alabama             258  1991
2   Alabama             244  1992
3   Alabama             269  1993
4   Alabama             275  1994
5   Alabama             262  1995
6   Alabama             257  1996
7   Alabama             312  1997
8   Alabama             232  1998
9   Alabama             334  1999
10  Alabama             205  2000
11  Alabama             253  2001
12  Alabama             206  2002
13  Alabama             215  2003
14  Alabama             190  2004
15  Alabama             230  2005
16  Alabama             218  2006
17  Alabama             259  2007
18  Alabama             246  2008
19  Alabama             235  2009

In [16]:
df_spojene.to_csv("Homicide_final.csv", sep=';', index=False)